apps/backend/test/load/scenarios/02-user-auth.yml
# Scenario: User Authentication Flow
#
# Purpose:
#   Stress-tests the auth endpoints under concurrent login load. Lower arrival
#   rate than browsing because bcrypt comparisons are CPU-intensive — this
#   helps surface CPU saturation and JWT-signing bottlenecks separately.
#
# Flow tested:
#   1. POST /auth/login  → captures accessToken
#   2. GET  /users/me    → authenticated profile fetch
#   3. POST /auth/refresh → token refresh (accepts 200 or 401 as valid)
#
# Load phases:
#   - Warm-up   : 30s  @ 5 req/s
#   - Ramp-up   : 60s  @ 5 → 50 req/s
#   - Sustained : 120s @ 50 req/s
#   - Cool-down : 30s  @ 50 → 10 req/s
#   Total duration : ~240s (4 min)
#
# SLA thresholds (test fails if breached):
#   - p95 response time  : 500ms
#   - p99 response time  : 1000ms
#   - Max error rate     : 0.5%
#
# Note: refresh step may 401 if refreshToken is not captured from login
#       response — this is expected and treated as valid (statusCode: [200, 401]).
#
# Run: npm run load:auth  (from apps/backend/)

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm-up'
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: 'Ramp-up'
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    - duration: 30
      arrivalRate: 50
      rampTo: 10
      name: 'Cool-down'
  variables:
    apiPrefix: '/api'
    testUserEmail: 'loadtest1@example.com'
    testUserPassword: 'LoadTest123!'
  defaults:
    headers:
      Content-Type: 'application/json'
  ensure:
    maxErrorRate: 0.5
    p95: 500
    p99: 1000

scenarios:
  - name: 'User Authentication Flow'
    flow:
      # User Login (most common)
      - post:
          url: '{{ apiPrefix }}/auth/login'
          json:
            email: '{{ testUserEmail }}'
            password: '{{ testUserPassword }}'
          expect:
            - statusCode: 200
          capture:
            json: '$.accessToken'
            as: 'accessToken'
      - think: 1
      # Get User Profile
      - get:
          url: '{{ apiPrefix }}/users/me'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200
      - think: 2
      # Refresh Token (less common)
      - post:
          url: '{{ apiPrefix }}/auth/refresh'
          json:
            refreshToken: '{{ refreshToken }}'
          expect:
            - statusCode: [200, 401]
      - think: 1