apps/backend/test/load/scenarios/03-shopping-cart.yml
# Scenario: Shopping Cart Operations
#
# Purpose:
#   Tests the full cart lifecycle under concurrent authenticated load — the
#   most write-heavy flow outside of checkout. Validates that concurrent
#   add/update operations don't corrupt cart state.
#
# Flow tested:
#   1. POST /auth/login          → captures accessToken
#   2. GET  /cart                → read current cart
#   3. POST /cart/items          → add product A (qty 1), captures cartItemId1
#   4. POST /cart/items          → add product B (qty 2)
#   5. GET  /cart                → verify cart contents
#   6. PATCH /cart/items/:id     → update product A quantity to 3
#                                  (accepts 200 or 404 — item may already be gone)
#
# Load phases:
#   - Warm-up   : 30s  @ 8 req/s
#   - Ramp-up   : 60s  @ 8 → 75 req/s
#   - Sustained : 120s @ 75 req/s
#   - Cool-down : 30s  @ 75 → 15 req/s
#   Total duration : ~240s (4 min)
#
# SLA thresholds (test fails if breached):
#   - p95 response time  : 400ms
#   - p99 response time  : 800ms
#   - Max error rate     : 0.5%
#
# Note: productIds in variables are placeholders. The scenario uses hardcoded
#       UUIDs (550e8400-...) that must exist in the test database seeded before run.
#
# Run: npm run load:cart  (from apps/backend/)

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 8
      name: 'Warm-up'
    - duration: 60
      arrivalRate: 8
      rampTo: 75
      name: 'Ramp-up'
    - duration: 120
      arrivalRate: 75
      name: 'Sustained load'
    - duration: 30
      arrivalRate: 75
      rampTo: 15
      name: 'Cool-down'
  variables:
    apiPrefix: '/api'
    testUserEmail: 'loadtest1@example.com'
    testUserPassword: 'LoadTest123!'
    productIds: ['uuid1', 'uuid2', 'uuid3']
  defaults:
    headers:
      Content-Type: 'application/json'
  ensure:
    maxErrorRate: 0.5
    p95: 400
    p99: 800

scenarios:
  - name: 'Shopping Cart Operations'
    flow:
      # Login first
      - post:
          url: '{{ apiPrefix }}/auth/login'
          json:
            email: '{{ testUserEmail }}'
            password: '{{ testUserPassword }}'
          expect:
            - statusCode: 200
          capture:
            json: '$.accessToken'
            as: 'accessToken'
      - think: 1
      # Get current cart
      - get:
          url: '{{ apiPrefix }}/cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200
      - think: 1
      # Add first product
      - post:
          url: '{{ apiPrefix }}/cart/items'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '550e8400-e29b-41d4-a716-446655440000'
            variantId: '550e8400-e29b-41d4-a716-446655440300'
            quantity: 1
          expect:
            - statusCode: 201
          capture:
            json: '$.items[0].id'
            as: 'cartItemId1'
      - think: 2
      # Add second product
      - post:
          url: '{{ apiPrefix }}/cart/items'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '550e8400-e29b-41d4-a716-446655440001'
            variantId: '550e8400-e29b-41d4-a716-446655440301'
            quantity: 2
          expect:
            - statusCode: 201
      - think: 2
      # View cart
      - get:
          url: '{{ apiPrefix }}/cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200
      - think: 1
      # Update quantity using captured cart item ID
      - patch:
          url: '{{ apiPrefix }}/cart/items/{{ cartItemId1 }}'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            quantity: 3
          expect:
            - statusCode: [200, 404]
      - think: 1